---
kind: property
id: P:Autodesk.Revit.DB.ElementLevelFilter.LevelId
source: html/edaa0ec7-c6fd-037a-3ee5-624953e4648c.htm
---
# Autodesk.Revit.DB.ElementLevelFilter.LevelId Property

The id of the level that will be matched to elements' associated level.

## Syntax (C#)
```csharp
public ElementId LevelId { get; }
```